Revit 2024 API
BuiltInFailures.EditingFailures.ElementsNotInPlane Property
 Elements don't lie on the same plane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ElementsNotInPlane { get; }
Visual Basic
Public Shared ReadOnly Property ElementsNotInPlane As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ElementsNotInPlane {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.EditingFailures Class
Autodesk.Revit.DB Namespace